---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.HostHasTooManyInserts
source: html/d2097449-8e90-bab6-6070-16c491bde85c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.HostHasTooManyInserts Property

Host object contains too many cutting inserts - it may take long time to update. Consider splitting host object into smaller pieces or using stacked walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostHasTooManyInserts { get; }
```